import styles from "./FooterInfo.module.css";

const FooterInfo = () => {
  return (
    <div className={styles.footerInfo}>
      <div>
        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
        النص من مولد النص العربى من مولد النص العربى
      </div>
      <div>
        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
        النص من مولد النص العربى من مولد النص العربى
      </div>
      <div>
        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
        النص من مولد النص العربى من مولد النص العربى
      </div>
      <div>
        هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
        النص من مولد النص العربى من مولد النص العربى
      </div>
    </div>
  );
};

export default FooterInfo;
