import styles from "./FooterInfo.module.css";

const FooterInfo = ({ category }) => {
  return (
    <div className={styles.footerInfo}>
      {category && (
        <>
          {category?.categoryNameArabic == "آلات زراعية" && (
            <div>
              آلات زراعية
              <br />
              شبكة متكاملة من المهتمين بالاقتصاد الزراعي التي توفر كافة المعدات
              والآلات الزراعية وبيعها وتأجيرها
            </div>
          )}
          {category?.categoryNameArabic == "تسويق محاصيل" && (
            <div>
              تسويق محاصيل
              <br />
              كما تتوفر خاصية عرض وشراء المحاصيل الزراعية بسعر السوق أيضا وتسويق
              المحاصيل الزراعية بأقل نسبة عمولة من قبل العملاء المتميزين كتشجيع
              للمستثمرين الزراعيين وتحفيزهم على إنتاج أفضل ما يمكن
            </div>
          )}
          {category?.categoryNameArabic == "مشاركة محاصيل" && (
            <div>
              مشاركة المحاصيل
              <br />
              عملاء متخصصين لمشاركة أصحاب المزارع الغير متفرغين بنسب مختلفة حسب
              الإتفاق لإدارة المعاملات الزراعية الخاصة وإدارة المزارع إدارة
              مؤسسية فريدة
            </div>
          )}
          {category?.categoryNameArabic == "أراضى زراعية" && (
            <div>
              اراضى زراعية
              <br />
              أراضي الزراعية جاهزة للزراعة ومؤسسة تأسيس هندسي زراعي متكامل من
              حيث التخطيط وشبكات الري المختلفة أيضا الأراضي المجهزة للزراعة بغرض
              التأجير طويل وقصير المدى لزراعة المحاصيل الموسمية والنباتات
              العطرية مع توفر كافة المستلزمات الزراعية تقاوي وشتلات وبذور وأسمدة
              ومبيدات وكمبوست
            </div>
          )}
          {category?.categoryNameArabic == "حدائق ريفية" && (
            <div>
              حدائق ريفية
              <br />
              حدائق ريفية للإيجار باليوم مجهزة لقضاء أوقات رائعة والاستمتاع
              بأجواء التخييم المتميزة وحفلات الشواء مع الأصدقاء والأطفال والهدوء
              والراحة
            </div>
          )}
        </>
      )}
      {!category && (
        <div style={{fontSize: '16px'}}>
          <div>
            آلات زراعية
            <br />
            شبكة متكاملة من المهتمين بالاقتصاد الزراعي التي توفر كافة المعدات
            والآلات الزراعية وبيعها وتأجيرها
          </div>
          <div>
            تسويق محاصيل
            <br />
            تتوفر خاصية عرض وشراء المحاصيل الزراعية بسعر السوق أيضا وتسويق
            المحاصيل الزراعية بأقل نسبة عمولة من قبل العملاء المتميزين كتشجيع
            للمستثمرين الزراعيين وتحفيزهم على إنتاج أفضل ما يمكن
          </div>
          <div>
            مشاركة المحاصيل
            <br />
            عملاء متخصصين لمشاركة أصحاب المزارع الغير متفرغين بنسب مختلفة حسب
            الإتفاق لإدارة المعاملات الزراعية الخاصة وإدارة المزارع إدارة مؤسسية
            فريدة
          </div>
          <div>
            اراضي زراعية
            <br />
            أراضي الزراعية جاهزة للزراعة ومؤسسة تأسيس هندسي زراعي متكامل من حيث
            التخطيط وشبكات الري المختلفة أيضا الأراضي المجهزة للزراعة بغرض
            التأجير طويل وقصير المدى لزراعة المحاصيل الموسمية والنباتات العطرية
            مع توفر كافة المستلزمات الزراعية تقاوي وشتلات وبذور وأسمدة ومبيدات
            وكمبوست
          </div>
          <div>
            حدائق ريفية
            <br />
            حدائق ريفية للإيجار باليوم مجهزة لقضاء أوقات رائعة والاستمتاع بأجواء
            التخييم المتميزة وحفلات الشواء مع الأصدقاء والأطفال والهدوء والراحة
          </div>
        </div>
      )}
    </div>
  );
};

export default FooterInfo;
